Revit 2024 API
BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricData Property
 The original model contains unsupported geometric data such as curves or points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }
Visual Basic
Public Shared ReadOnly Property ATFContainedUnsupportedGeometricData As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ATFContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace